---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.HaveNoPermissionToEdit
source: html/559c44f3-e0b6-cf3e-3984-b9a134de3c61.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.HaveNoPermissionToEdit Property

You do not have permission to edit the element.

## Syntax (C#)
```csharp
public static FailureDefinitionId HaveNoPermissionToEdit { get; }
```